---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevel
source: html/8370d2c4-66fa-7f5a-7c4d-9ae3d6353d4d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevel Property

Multistory top level must be above the stair/ramp top and bottom levels.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryLevelBelowTopbottomLevel { get; }
```